app/Controllers/Angkatan.php

    public function save()
    {
        if (!$this->validate([
            'name' => 'required',
            'biaya' => 'required|integer',
        ])) {
            return redirect()->to(base_url('angkatan'))->withInput();
        }
        $this->angkatan->save([
            "nama_angkatan" => $this->request->getVar('name'),
            "biaya" => $this->request->getVar('biaya'),
        ]);
---
INSERT INTO `angkatan` (`nama_angkatan`, `biaya`) VALUES ('2023/2024', '10000')