app/Controllers/Pembayaran.php

    public function prosesTransaksi()
    {
        $nisn = $this->request->getGet('nisn');
        $dataSiswa = $this->siswa->getByNisn($nisn);
        if (!$dataSiswa) {
            return redirect()->to(base_url('pembayaran'));
        }

        $idPembayaran = $this->request->getGet('id');
        $dataPembayaran = $this->pembayaran->getById($idPembayaran);
        if (!$dataPembayaran) {
            return redirect()->to(base_url('pembayaran'));
        }

        if ($dataPembayaran['nobayar'] == '') {
            $tglbayar = date('Y-m-d');
            $nobayar = date('dmYHisis');

            $this->pembayaran->save([
                "id_pembayaran" => $idPembayaran,
                "nobayar" => $nobayar,
                "tglbayar" => $tglbayar,
                "ket" => "LUNAS",
            ]);
            return redirect()->to(base_url("pembayaran?nisn=$nisn"));
        } else {
            $this->pembayaran->save([
                "id_pembayaran" => $idPembayaran,
                "nobayar" => '',
                "tglbayar" => '',
                "ket" => "",
            ]);
---
UPDATE `pembayaran` SET `nobayar` = '150620240618541854', `tglbayar` = '2024-06-15', `ket` = 'LUNAS'
WHERE `pembayaran`.`id_pembayaran` IN ('469')
UPDATE `pembayaran` SET `nobayar` = '', `tglbayar` = '', `ket` = ''
WHERE `pembayaran`.`id_pembayaran` IN ('3')