app/Models/Angkatan_model.php

    public function getAll()
    {
        return $this->orderBy('id_angkatan', 'ASC')->findAll();
---
SELECT *
FROM `angkatan`
ORDER BY `id_angkatan` ASC