app/Models/Jurusan_model.php

    public function getAll()
    {
        return $this->orderBy('id_jurusan', 'ASC')->findAll();
---
SELECT *
FROM `jurusan`
ORDER BY `id_jurusan` ASC