app/Models/Kelas_model.php

    public function getAll()
    {
        return $this->orderBy('id_kelas', 'ASC')->findAll();
---
SELECT *
FROM `kelas`
ORDER BY `id_kelas` ASC