app/Models/Pembayaran_model.php

SELECT *
FROM `pembayaran`
WHERE `id_pembayaran` = '3'
 LIMIT 1
---
    public function getById($id)
    {
        return $this->where('id_pembayaran', $id)->first();

SELECT *
FROM `pembayaran`
WHERE `siswa` = '1'
ORDER BY `jatuhtempo` ASC
---
    public function search($idSiswa)
    {
        return $this->where('siswa', $idSiswa)->orderBy('jatuhtempo', 'ASC')->findAll();

SELECT *
FROM `pembayaran`
WHERE `siswa` = '1'
AND `ket` = 'LUNAS'
ORDER BY `jatuhtempo` ASC
---
    public function searchCetak($idSiswa)
    {
        return $this->where('siswa', $idSiswa)->where('ket', 'LUNAS')->orderBy('jatuhtempo', 'ASC')->findAll();

SELECT *
FROM `pembayaran`
WHERE `ket` = 'LUNAS'
---
    public function getLunas()
    {
        return $this->where('ket', 'LUNAS')->findAll();