app/Models/Siswa_Model.php

    public function getAll()
    {
        return $this->select('siswa.*, angkatan.*, jurusan.*, kelas.*')
            ->join('angkatan', 'siswa.angkatan = angkatan.id_angkatan')
            ->join('jurusan', 'siswa.jurusan = jurusan.id_jurusan')
            ->join('kelas', 'siswa.kelas = kelas.id_kelas')
            ->orderBy('id_siswa', 'ASC')
            ->findAll();
---
SELECT `siswa`.*, `angkatan`.*, `jurusan`.*, `kelas`.*
FROM `siswa`
JOIN `angkatan` ON `siswa`.`angkatan` = `angkatan`.`id_angkatan`
JOIN `jurusan` ON `siswa`.`jurusan` = `jurusan`.`id_jurusan`
JOIN `kelas` ON `siswa`.`kelas` = `kelas`.`id_kelas`
ORDER BY `id_siswa` ASC

    public function getByNisn($nisn)
    {
        return $this->select('siswa.*, angkatan.*, jurusan.*, kelas.*')
            ->join('angkatan', 'siswa.angkatan = angkatan.id_angkatan')
            ->join('jurusan', 'siswa.jurusan = jurusan.id_jurusan')
            ->join('kelas', 'siswa.kelas = kelas.id_kelas')
            ->where(['nisn' => $nisn])
            ->first();
---
SELECT `siswa`.*, `angkatan`.*, `jurusan`.*, `kelas`.*
FROM `siswa`
JOIN `angkatan` ON `siswa`.`angkatan` = `angkatan`.`id_angkatan`
JOIN `jurusan` ON `siswa`.`jurusan` = `jurusan`.`id_jurusan`
JOIN `kelas` ON `siswa`.`kelas` = `kelas`.`id_kelas`
WHERE `nisn` = '100'
 LIMIT 1